---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RuledCurtainElementLostCurves
source: html/6ae248fa-e4d9-3c59-8499-ac7a342c11dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RuledCurtainElementLostCurves Property

Ruled Curtain System cannot be built. The Lines or Edges used to create it cannot be found.

## Syntax (C#)
```csharp
public static FailureDefinitionId RuledCurtainElementLostCurves { get; }
```